# customer-api - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/customer_api]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=48z95dc90j]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.lambda_role: Refreshing state... [id=le-customer_api]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 0s [id=upstash_kafka_cluster_credential_id]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=89aed7d6-74bd-48f1-b647-6af2544ab965:customer_api]
module.common_resources.data.aws_cognito_user_pools.user_pool: Read complete after 0s [id=staging]
module.common_resources.data.curl.cognito_user_pool_keys: Reading...
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-customer_api-20230526003504777700000001]
module.common_resources.data.curl.cognito_user_pool_keys: Read complete after 0s [id=1685140077]
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/customer_api]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 0s [id=upstash-kafka-credential-eb242819-37a2-4bda-95c8-95845e1d3f58]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-09f3f36d-4eb7-4cbd-92a0-6cf27d288db1]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 2s [id=54698a2ee434c8fb545a32fa32009c47f4fb47ec]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=customer_api]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=8zy6h82]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any["all"]: Refreshing state... [id=hd52y1v]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "customer_api"
      ~ last_modified                  = "2023-05-26T11:22:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "OgeUe3ffQV5H49lDFjek2OlFjQvlUy03C8HhX2NcK1s=" -> "Ex30TpIcbzS1sIA5GoLu5eRki1c1P0TTKpynOQ79apQ="
        tags                           = {
            "domain"        = "customer"
            "environment"   = "staging"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS"                           = "striking-caiman-7501-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"                                 = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"                                  = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"                                    = "4266c8cb2fed44d0ad797201a2e02a68"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"                              = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"                                    = "c3RyaWtpbmctY2FpbWFuLTc1MDEkoN_jLmJ-2v_pseQpmftvn5l-RyAzXMPw9Vk"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"                                 = (sensitive value)
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_DEFAULT_KEYS"             = jsonencode(
                    {
                      - keys = [
                          - {
                              - alg = "RS256"
                              - e   = "AQAB"
                              - kid = "FEtNti0B1nq6tJqpI5PrzXUDrlPpEcFvCtU/Wc+XW5Y="
                              - kty = "RSA"
                              - n   = "xYDETyYIgjPLRj5bXahJmz2Dgzmmv6SWNKuWFicCcihSljqnYKqiFr2CrJMavWE5Lv0s4FFqn4UNceA9qt6HQoUNekq7N-h8O7mSKG_4dAqc4kVaMFH559pfeokoovYjDK6PuVnvDKh5v0i_Num8rT-tRrcH21mdb15L11yIQUIhDYkLzQ0e3gMStIQbuP77sGg7GnDaW9sYhWgpi9PORs7c8yLbOMDqaR9z9PDQDcbeHtn0VHkLZS4XPSwE1In9aVl5R_1HDTZT1pQRy2tFyUZw8_RP3K20LiHTE8N-Rttjaq73xmHFfJO4bFWg70wJO0FXa07qcXIzbrEu1GuChQ"
                              - use = "sig"
                            },
                          - {
                              - alg = "RS256"
                              - e   = "AQAB"
                              - kid = "I0oDBYSDSmM0n4eZtntZoCs5Dq/rJjSMbdRQXY/L6Zg="
                              - kty = "RSA"
                              - n   = "uUkRK5fbHPQ8THSdLEKstf1xgy67q55ZymkJtZZavnnIWbvxdtC4FYMzCMohLopMUweCygdW4oP1sV5UHMyJFXEyqZUPcUpY247wa_gZSN67Svvrx1fKEVy7iqCgiELAiHLl5weMCc49Wumelo5K8MQf0FylBX1PRyIBPjLlsMppCtt5JbH3VIhd5Dx-RPn53uYYBbCPQcosgxLITgMU6igJnsGdfFfhTXudubWHlKlWcr4nGrZYgYKsfq_noGaxJSruiwffQZZyLwLOso-_KT3k06ZEGVbp8shVyt8lGYTJJV4pCAjhy9gY54lhlWZEVZPhwu8Vxupma0f-xXnKGQ"
                              - use = "sig"
                            },
                        ]
                    }
                )
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_DEFAULT_REFRESH_RSA_KEYS" = "false"
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_URL"                      = "https://cognito-idp.us-east-1.amazonaws.com/us-east-1_2ZescOZ9X/.well-known/jwks.json"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer_api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "89aed7d6-74bd-48f1-b647-6af2544ab965:customer_api"
        name       = "customer_api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "3acc2ad4-56bb-470f-b868-0f08e02b4f3d" -> "dada7102-a7a9-4c75-b80b-0dbc36e6d2ab"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*